In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns
import datetime as dt
from scipy import stats
from scipy.stats import norm

In [2]:
flights = pd.read_csv('data/flights-2018-2019.csv')

In [3]:
df_flights = flights.copy()
#columns_test = ["fl_date","mkt_carrier","mkt_carrier_fl_num","origin","dest","predicted_delay"]

In [4]:
def check_empty_data(column):
    """check nan, empty list [], dict {} column with more than 40% within column"""
    
    if column.isnull().sum()/len(column)*100 > 40:
        return True
    else:
        return False

def drop_na(df):
    """drop all columns with nan or empty list value more than 40% within column, using function check_empty_data"""
    nan_value = np.nan
    for col in df.columns:
        #bool_val, nul_val = check_empty_column(df[col])
        if check_empty_data(df[col]) == True:
            df.drop(col, axis=1, inplace=True)

In [5]:
drop_na(df_flights)

In [6]:
df_flights.columns

Index(['fl_date', 'mkt_unique_carrier', 'branded_code_share', 'mkt_carrier',
       'mkt_carrier_fl_num', 'op_unique_carrier', 'tail_num',
       'op_carrier_fl_num', 'origin_airport_id', 'origin', 'origin_city_name',
       'dest_airport_id', 'dest', 'dest_city_name', 'crs_dep_time', 'dep_time',
       'dep_delay', 'taxi_out', 'wheels_off', 'wheels_on', 'taxi_in',
       'crs_arr_time', 'arr_time', 'arr_delay', 'cancelled', 'diverted', 'dup',
       'crs_elapsed_time', 'actual_elapsed_time', 'air_time', 'flights',
       'distance', 'row_num'],
      dtype='object')

In [52]:
row_num, mkt_unique_carrier, branded_code_share, op_unique_carrier, tail_num, op_carrier_fl_num, origin_airport_id,

,fl_date,mkt_unique_carrier,branded_code_share,mkt_carrier,mkt_carrier_fl_num,op_unique_carrier,tail_num,op_carrier_fl_num,origin_airport_id,origin,...,arr_time,arr_delay,cancelled,diverted,dup,crs_elapsed_time,actual_elapsed_time,air_time,flights,distance
0,2018-01-01,WN,WN,WN,5705,WN,N8510E,5705,15304,TPA,...,1831.0,21.0,0,0,N,160,153.0,134.0,1,1130
1,2018-01-01,WN,WN,WN,988,WN,N287WN,988,13495,MSY,...,732.0,-8.0,0,0,N,75,69.0,57.0,1,302
2,2018-01-01,WN,WN,WN,1236,WN,N729SW,1236,13495,MSY,...,740.0,-15.0,0,0,N,100,86.0,70.0,1,551
3,2018-01-01,WN,WN,WN,233,WN,N958WN,233,13495,MSY,...,1829.0,9.0,0,0,N,290,283.0,271.0,1,1903
4,2018-01-01,WN,WN,WN,446,WN,N7708E,446,13495,MSY,...,2013.0,23.0,0,0,N,105,125.0,83.0,1,604
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
14595,2019-12-31,WN,WN,WN,5451,WN,N914WN,5451,12953,LGA,...,2154.0,54.0,0,0,N,205,165.0,155.0,1,1107
14596,2019-12-31,WN,WN,WN,2038,WN,N7874B,2038,12953,LGA,...,1336.0,1.0,0,0,N,160,165.0,108.0,1,725
14597,2019-12-31,WN,WN,WN,3255,WN,N767SW,3255,12953,LGA,...,1453.0,-17.0,0,0,N,215,198.0,179.0,1,1183
14598,2019-12-31,WN,WN,WN,4880,WN,N736SA,4880,12953,LGA,...,1149.0,-1.0,0,0,N,185,174.0,158.0,1,1010
14599,2019-12-31,WN,WN,WN,6094,WN,N7883A,6094,12954,LGB,...,1529.0,-11.0,0,0,N,75,66.0,54.0,1,324

In [ ]:
(df_flights.mkt_unique_carrier == df_flights.branded_code_share).unique()

In [ ]:
flights.columns

In [39]:
fuel_con = pd.read_csv('data/fuel_comsumption-2018-2019.csv')
passengers = pd.read_csv('data/passengers-2018-2019.csv')
weather_df = pd.read_csv('data/weather-20182019.csv')
#weather_df = pd.read_csv('data/weather-20182019.csv')

## weather data cleaning for origin and dest city

In [43]:
weather_df.rename(columns={'city': 'origin_city_name', 'date': 'fl_date'}, inplace=True)
#weather_df.head(5)
weather_df['origin_city_condn'] = np.nan

          fl_date   origin_city_name      condition  origin_city_condn
0      2018-01-01    New Orleans, LA         Cloudy                NaN
1      2018-01-01        Oakland, CA  Partly cloudy                NaN
2      2018-01-01          Tampa, FL     Light rain                NaN
3      2018-01-01         Albany, NY  Partly cloudy                NaN
4      2018-01-01        Burbank, CA  Partly cloudy                NaN
...           ...                ...            ...                ...
18671  2019-12-31     Sacramento, CA  Partly cloudy                NaN
18672  2019-12-31  San Francisco, CA  Partly cloudy                NaN
18673  2019-12-31       San Jose, CA  Partly cloudy                NaN
18674  2019-12-31      Santa Ana, CA  Partly cloudy                NaN
18675  2019-12-31          Tampa, FL          Sunny                NaN

[18676 rows x 4 columns]

In [44]:
condition_dict = {'cloundy': ['Cloudy','Overcast'],
                  'sunny': ['Partly cloudy','Sunny'],
                  'low_snow' : ['Freezing drizzle','Patchy snow possible', 'Patchy light snow','Light snow'],
                  'snow': ['Light snow showers','Moderate or heavy snow with thunder','Light showers of ice pellets','Light sleet','Moderate snow','Patchy heavy snow','Patchy moderate snow','Moderate or heavy snow showers'],
                  'low_rainny': ['Mist','Patchy light drizzle','Light drizzle','Patchy rain possible','Light rain','Patchy sleet possible','Patchy light rain'],
                  'rainny': ['Light rain shower','Patchy freezing drizzle possible','Patchy light rain with thunder','Heavy rain at times','Light sleet showers','Moderate or heavy rain with thunder','Heavy rain','Light freezing rain','Moderate rain','Moderate or heavy rain shower','Moderate rain at times'],
                  'harzard': ['Thundery outbreaks possible','Blowing snow','Torrential rain shower','Freezing fog','Moderate or heavy freezing rain','Ice pellets','Fog','Moderate or heavy sleet','Heavy snow', 'Blizzard']
                 }

In [46]:
for key, conditions in condition_dict.items():
    for condition in conditions:
        weather_df.loc[weather_df['condition'] == condition, "origin_city_condn"] = key

In [116]:
weather_df.shape,weather_df.head(5)

((18676, 4),
       fl_date   dest_city_name      condition origin_city_condn
 0  2018-01-01  New Orleans, LA         Cloudy           cloundy
 1  2018-01-01      Oakland, CA  Partly cloudy             sunny
 2  2018-01-01        Tampa, FL     Light rain        low_rainny
 3  2018-01-01       Albany, NY  Partly cloudy             sunny
 4  2018-01-01      Burbank, CA  Partly cloudy             sunny)

In [50]:
origin_df = flights[['fl_date', 'origin_city_name']]
origin_df.shape

(14600, 2)

In [106]:
origin_df.head(5)

      fl_date origin_city_name
0  2018-01-01        Tampa, FL
1  2018-01-01  New Orleans, LA
2  2018-01-01  New Orleans, LA
3  2018-01-01  New Orleans, LA
4  2018-01-01  New Orleans, LA

In [75]:
#df.merge(df2.drop_duplicates(subset=['A']), how='left')
origin_weather_merged = pd.merge(origin_df, weather_df.drop_duplicates(), how="left", on=["fl_date","origin_city_name"])

In [112]:
origin_weather_merged.shape, origin_weather_merged.isnull().sum()

((14600, 3),
 fl_date              0
 origin_city_name     0
 origin_city_condn    0
 dtype: int64)

In [90]:
origin_weather_merged.drop(columns='condition', inplace=True)

In [93]:
origin_weather_merged.to_csv("origin_weather_merged.csv")

#### working on dest city

In [102]:
dest_df = flights[['fl_date', 'dest_city_name']]
dest_df.shape,dest_df.head(5)

((14600, 2),
       fl_date dest_city_name
 0  2018-01-01     Albany, NY
 1  2018-01-01    Houston, TX
 2  2018-01-01    Orlando, FL
 3  2018-01-01    Oakland, CA
 4  2018-01-01  St. Louis, MO)

In [134]:
#use the weather_df above just change origin to dest(extra caution when use weather_df again)
weather_df.rename(columns={'origin_city_name': 'dest_city_name', 'origin_city_condn': 'dest_city_cond'},inplace=True)
weather_df.shape, weather_df.head(5)

((18676, 4),
       fl_date   dest_city_name      condition dest_city_cond
 0  2018-01-01  New Orleans, LA         Cloudy        cloundy
 1  2018-01-01      Oakland, CA  Partly cloudy          sunny
 2  2018-01-01        Tampa, FL     Light rain     low_rainny
 3  2018-01-01       Albany, NY  Partly cloudy          sunny
 4  2018-01-01      Burbank, CA  Partly cloudy          sunny)

In [109]:
#merge to get weather for dest city
dest_weather_merged = pd.merge(dest_df, weather_df.drop_duplicates(), how="left", on=["fl_date","dest_city_name"])

In [111]:
dest_weather_merged.shape, dest_weather_merged.head(5), dest_weather_merged.isnull().sum()

((14600, 4),
       fl_date dest_city_name      condition origin_city_condn
 0  2018-01-01     Albany, NY  Partly cloudy             sunny
 1  2018-01-01    Houston, TX  Partly cloudy             sunny
 2  2018-01-01    Orlando, FL     Light rain        low_rainny
 3  2018-01-01    Oakland, CA  Partly cloudy             sunny
 4  2018-01-01  St. Louis, MO  Partly cloudy             sunny,
 fl_date              0
 dest_city_name       0
 condition            0
 origin_city_condn    0
 dtype: int64)

In [121]:
dest_weather_merged.rename(columns={'origin_city_condn': 'dest_city_condn'},inplace=True)
dest_weather_merged.drop(columns='condition', inplace=True)

In [122]:
dest_weather_merged.shape,dest_weather_merged.head(5)

((14600, 3),
       fl_date dest_city_name dest_city_condn
 0  2018-01-01     Albany, NY           sunny
 1  2018-01-01    Houston, TX           sunny
 2  2018-01-01    Orlando, FL      low_rainny
 3  2018-01-01    Oakland, CA           sunny
 4  2018-01-01  St. Louis, MO           sunny)

In [123]:
dest_weather_merged.to_csv("dest_weather_merged.csv")

### merge origin and dest weather df

In [3]:
origin_wth = pd.read_csv('origin_weather_merged.csv')
dest_wth = pd.read_csv('dest_weather_merged.csv')
origin_wth.drop(columns='Unnamed: 0', inplace=True)
dest_wth.drop(columns='Unnamed: 0', inplace=True)
origin_wth.shape, origin_wth.head(5)

((14600, 3),
       fl_date origin_city_name origin_city_condn
 0  2018-01-01        Tampa, FL        low_rainny
 1  2018-01-01  New Orleans, LA           cloundy
 2  2018-01-01  New Orleans, LA           cloundy
 3  2018-01-01  New Orleans, LA           cloundy
 4  2018-01-01  New Orleans, LA           cloundy)

In [4]:
dest_wth.shape, dest_wth.head(5)

((14600, 3),
       fl_date dest_city_name dest_city_condn
 0  2018-01-01     Albany, NY           sunny
 1  2018-01-01    Houston, TX           sunny
 2  2018-01-01    Orlando, FL      low_rainny
 3  2018-01-01    Oakland, CA           sunny
 4  2018-01-01  St. Louis, MO           sunny)

In [10]:
#when tables have duplicate values in columns, merge them in pandas will be .dot() product of two tables
pd.merge(origin_wth, dest_wth, how="left", on=["fl_date"])

,fl_date,origin_city_name,origin_city_condn,dest_city_name,dest_city_condn
0,2018-01-01,"Tampa, FL",low_rainny,"Albany, NY",sunny
1,2018-01-01,"Tampa, FL",low_rainny,"Houston, TX",sunny
2,2018-01-01,"Tampa, FL",low_rainny,"Orlando, FL",low_rainny
3,2018-01-01,"Tampa, FL",low_rainny,"Oakland, CA",sunny
4,2018-01-01,"Tampa, FL",low_rainny,"St. Louis, MO",sunny
...,...,...,...,...,...
291995,2019-12-31,"Long Beach, CA",sunny,"Kansas City, MO",sunny
291996,2019-12-31,"Long Beach, CA",sunny,"Chicago, IL",low_snow
291997,2019-12-31,"Long Beach, CA",sunny,"New Orleans, LA",sunny
291998,2019-12-31,"Long Beach, CA",sunny,"Tampa, FL",sunny
291999,2019-12-31,"Long Beach, CA",sunny,"San Jose, CA",sunny

In [6]:
routes = flights[['fl_date','origin_city_name', 'dest_city_name']]
routes.shape, routes.head(5)

((14600, 3),
       fl_date origin_city_name dest_city_name
 0  2018-01-01        Tampa, FL     Albany, NY
 1  2018-01-01  New Orleans, LA    Houston, TX
 2  2018-01-01  New Orleans, LA    Orlando, FL
 3  2018-01-01  New Orleans, LA    Oakland, CA
 4  2018-01-01  New Orleans, LA  St. Louis, MO)

In [11]:
first_merged = pd.merge(routes, origin_wth.drop_duplicates(), how="left", on=["fl_date", "origin_city_name"])

In [12]:
first_merged.isnull().sum()

fl_date              0
origin_city_name     0
dest_city_name       0
origin_city_condn    0
dtype: int64

In [15]:
origin_dest_weather = pd.merge(first_merged, dest_wth.drop_duplicates(), how="left", on=["fl_date", "dest_city_name"])

In [16]:
origin_dest_weather.shape, origin_dest_weather.head(5)

((14600, 5),
       fl_date origin_city_name dest_city_name origin_city_condn  \
 0  2018-01-01        Tampa, FL     Albany, NY        low_rainny
 1  2018-01-01  New Orleans, LA    Houston, TX           cloundy
 2  2018-01-01  New Orleans, LA    Orlando, FL           cloundy
 3  2018-01-01  New Orleans, LA    Oakland, CA           cloundy
 4  2018-01-01  New Orleans, LA  St. Louis, MO           cloundy

   dest_city_condn
 0           sunny
 1           sunny
 2      low_rainny
 3           sunny
 4           sunny  )

In [17]:
origin_dest_weather

In [18]:
pd.read_csv('final_origin_dest_weather.csv')

,Unnamed: 0,fl_date,origin_city_name,dest_city_name,origin_city_condn,dest_city_condn
0,0,2018-01-01,"Tampa, FL","Albany, NY",low_rainny,sunny
1,1,2018-01-01,"New Orleans, LA","Houston, TX",cloundy,sunny
2,2,2018-01-01,"New Orleans, LA","Orlando, FL",cloundy,low_rainny
3,3,2018-01-01,"New Orleans, LA","Oakland, CA",cloundy,sunny
4,4,2018-01-01,"New Orleans, LA","St. Louis, MO",cloundy,sunny
...,...,...,...,...,...,...
14595,14595,2019-12-31,"New York, NY","Kansas City, MO",cloundy,sunny
14596,14596,2019-12-31,"New York, NY","Chicago, IL",cloundy,low_snow
14597,14597,2019-12-31,"New York, NY","New Orleans, LA",cloundy,sunny
14598,14598,2019-12-31,"New York, NY","Tampa, FL",cloundy,sunny
14599,14599,2019-12-31,"Long Beach, CA","San Jose, CA",sunny,sunny

## traffic flight cleanning

In [127]:
fl_traff = pd.read_csv('data/flight_traffic_20182019.csv')

In [128]:
fl_traff.head(5)

  origin_city_name         dest_city_name  count
0     Aberdeen, SD        Minneapolis, MN   1492
1      Abilene, TX  Dallas/Fort Worth, TX   4291
2  Adak Island, AK          Anchorage, AK    207
3    Aguadilla, PR    Fort Lauderdale, FL   1258
4    Aguadilla, PR             Newark, NJ    674

In [129]:
fl_data = flights[['fl_date', 'origin_city_name', 'dest_city_name']]

In [130]:
fl_data.head(5)

      fl_date origin_city_name dest_city_name
0  2018-01-01        Tampa, FL     Albany, NY
1  2018-01-01  New Orleans, LA    Houston, TX
2  2018-01-01  New Orleans, LA    Orlando, FL
3  2018-01-01  New Orleans, LA    Oakland, CA
4  2018-01-01  New Orleans, LA  St. Louis, MO

In [131]:
traff_merged = pd.merge(fl_data, fl_traff, how="left", on=["origin_city_name","dest_city_name"])a

In [132]:
traff_merged.shape, traff_merged.head(5)

((14600, 4),
       fl_date origin_city_name dest_city_name  count
 0  2018-01-01        Tampa, FL     Albany, NY    741
 1  2018-01-01  New Orleans, LA    Houston, TX  12826
 2  2018-01-01  New Orleans, LA    Orlando, FL   3889
 3  2018-01-01  New Orleans, LA    Oakland, CA    710
 4  2018-01-01  New Orleans, LA  St. Louis, MO   1466)

In [168]:
traff_merged.to_csv('data/traff_flights.csv')